root-2.3.0/run/MicroChannelFoam/MicroChannel/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0e-5;

vertices
(
    (0 0 0)
    (10 0 0)
    (100 0 0)
    (0 4.5 0)
    (10 4.5 0)
    (100 4.5 0)
    (0 5.5 0)
    (10 5.5 0)
    (100 5.5 0)
    (0 10 0)
    (10 10 0)
    (100 10 0)
    (0 0 0.1)
    (10 0 0.1)
    (100 0 0.1)
    (0 4.5 0.1)
    (10 4.5 0.1)
    (100 4.5 0.1)
    (0 5.5 0.1)
    (10 5.5 0.1)
    (100 5.5 0.1)
    (0 10 0.1)
    (10 10 0.1)
    (100 10 0.1)
);

blocks
(
    hex (0 1 4 3 12 13 16 15) (10 10 1) simpleGrading (1 1 1)
    hex (1 2 5 4 13 14 17 16) (90 10 1) simpleGrading (1 1 1)
    hex (3 4 7 6 15 16 19 18) (10 10 1) simpleGrading (1 1 1)
    hex (4 5 8 7 16 17 20 19) (90 10 1) simpleGrading (1 1 1)
    hex (6 7 10 9 18 19 22 21) (10 10 1) simpleGrading (1 1 1)
    hex (7 8 11 10 19 20 23 22) (90 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    AirInlet
    {
        type patch;
        faces
        (
            (15 3 6 18)
        );
    }
    WaterInlet
    {
        type patch;
        faces
        (
            (12 0 3 15)
            (18 6 9 21)
        );
    }
    ChannelWall
    {
        type wall;
        faces
        (
            (21 9 10 22)
            (22 10 11 23)
            (12 0 1 13)
            (13 1 2 14)
        );
    }
    Outlet
    {
        type patch;
        faces
        (
            (20 8 11 23)
            (17 5 8 20)
            (14 2 5 17)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (6 7 10 9)
            (7 8 11 10)
            (3 4 7 6)
            (4 5 8 7)
            (0 1 4 3)
            (1 2 5 4)
            (18 19 22 21)
            (19 20 23 22)
            (15 16 19 18)
            (16 17 20 19)
            (12 13 16 15)
            (13 14 17 16)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
