root-2.3.0/run/MicroChannelFoam/MicroChannel/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volVectorFieldvalue U (0.1 0 0)
);

regions
(
    boxToCell
    {
        box (0 4.5e-5 0) (10.0e-5 5.5e-5 0.1e-5);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volVectorFieldvalue U (0.001 0 0)
        );
    }
);


// ************************************************************************* //
